In [8]:
import pandas as pd
from sqlalchemy import create_engine
from sqlalchemy_utils import create_database, database_exists
import pymysql
pymysql.install_as_MySQLdb()
from urllib.parse import quote_plus as urlquote

# ## Change username and password to match your personal MySQL Server settings
# username = 'root' # default username for MySQL db is root
# password = 'password' # whatever password you chose during MySQL installation.

# connection = f'mysql+pymysql://{username}:{password}@localhost/Chinook'
# engine = create_engine(connection)

In [3]:
import json
with open('/Users/sherlin01/.secret/mysql.json') as f:
    login = json.load(f)
login.keys()

dict_keys(['username', 'password'])

In [10]:
connection = f"mysql+pymysql://{login['username']}:{urlquote(login['password'])}@localhost/world"
engine = create_engine(connection)

In [11]:
## Check if database exists, if not, create it
if database_exists(connection):
    print('It exists!')
else:
    create_database(connection)
    print('Database created!')

It exists!

In [12]:
q = '''SHOW TABLES'''
pd.read_sql(q,engine)

  Tables_in_world
0          cities
1       countries
2       languages

In [22]:
q = '''SELECT * FROM cities
        LIMIT 2;'''
pd.read_sql(q,engine)

   id      name country_code  district  population  country_id
0   1     Kabul          AFG     Kabol     1780000           2
1   2  Qandahar          AFG  Qandahar      237500           2

In [23]:
q = '''SELECT * FROM countries
        LIMIT 2;'''
pd.read_sql(q,engine)

,id,code,name,continent,region,surface_area,indep_year,population,life_expectancy,gnp,gnp_old,local_name,government_form,head_of_state,capital,code2
0,1,ABW,Aruba,North America,Caribbean,193.0,NaN,103000,78.4,828.0,793.0,Aruba,Nonmetropolitan Territory of The Netherlands,Beatrix,129,AW
1,2,AFG,Afghanistan,Asia,Southern and Central Asia,652090.0,1919.0,22720000,45.9,5976.0,NaN,Afganistan/Afqanestan,Islamic Emirate,Mohammad Omar,1,AF

In [24]:
q = '''SELECT * FROM languages
        LIMIT 2;'''
pd.read_sql(q,engine)

   id country_code language is_official  percentage  country_id
0   1          ABW    Dutch           T         5.3           1
1   2          ABW  English           F         9.5           1

1. What query would you run to get all the countries with a Surface Area below 501 and a Population greater than 100,000? Include the country name, surface area, and population in your results.

In [13]:
q = '''SELECT countries.name, countries.surface_area, countries.population
        FROM countries
        WHERE countries.surface_area < 501 AND countries.population > 100000;'''
pd.read_sql(q,engine)

                               name  surface_area  population
0                             Aruba         193.0      103000
1                          Barbados         430.0      270000
2                             Macao          18.0      473000
3                          Maldives         298.0      286000
4                             Malta         316.0      380200
5                           Mayotte         373.0      149000
6  Saint Vincent and the Grenadines         388.0      114000

2. What query would you run to get countries with only a Constitutional Monarchy with a capital greater than 200 and a life expectancy greater than 75 years? Include the country name, form of government, and capital in your results.

In [26]:
q = '''SELECT countries.name, countries.government_form, countries.capital
        FROM countries
        WHERE countries.government_form = 'Constitutional Monarchy'
            AND countries.capital > 200
            AND countries.life_expectancy > 75;'''
pd.read_sql(q,engine)

              name          government_form  capital
0          Denmark  Constitutional Monarchy     3315
1            Spain  Constitutional Monarchy      653
2   United Kingdom  Constitutional Monarchy      456
3          Jamaica  Constitutional Monarchy     1530
4           Jordan  Constitutional Monarchy     1786
5            Japan  Constitutional Monarchy     1532
6    Liechtenstein  Constitutional Monarchy     2446
7       Luxembourg  Constitutional Monarchy     2452
8           Monaco  Constitutional Monarchy     2695
9           Norway  Constitutional Monarchy     2807
10     New Zealand  Constitutional Monarchy     3499
11          Sweden  Constitutional Monarchy     3048

3. What query would you run to summarize the number of countries in each region? The query should display the name of the region and the number of countries. Also, the query should arrange the result by the number of countries in descending order.

In [27]:
q = '''SELECT countries.region, COUNT(countries.region) AS num_countries
        FROM countries
        GROUP BY countries.region
        ORDER BY num_countries DESC;'''
pd.read_sql(q,engine)

                       region  num_countries
0                   Caribbean             24
1              Eastern Africa             20
2                 Middle East             18
3              Western Africa             17
4             Southern Europe             15
5   Southern and Central Asia             14
6               South America             14
7              Southeast Asia             11
8                   Polynesia             10
9              Eastern Europe             10
10             Central Africa              9
11             Western Europe              9
12            Central America              8
13               Eastern Asia              8
14           Nordic Countries              7
15            Northern Africa              7
16                 Micronesia              7
17                 Antarctica              5
18  Australia and New Zealand              5
19              North America              5
20            Southern Africa              5
21                  Melanesia              5
22           Baltic Countries              3
23            British Islands              2
24       Micronesia/Caribbean              1

4. What query would you run to get all the countries that speak Slovene? Your query should return the name of the country, language, and language percentage. Your query should arrange the result by language percentage in descending order.

In [29]:
q = '''SELECT countries.name, languages.language, languages.percentage
        FROM countries
        JOIN languages ON countries.id = languages.country_id
        WHERE languages.language = 'Slovene'
        ORDER BY languages.percentage DESC;'''
pd.read_sql(q,engine)

       name language  percentage
0  Slovenia  Slovene        87.9
1   Austria  Slovene         0.4
2     Italy  Slovene         0.2
3   Croatia  Slovene         0.0

5. What query would you run to display the total number of cities for each country? Your query should return the name of the country and the total number of cities. Your query should arrange the result by the number of cities in descending order.

In [30]:
q = '''SELECT countries.name, COUNT(cities.id) AS num_cities
        FROM countries
        JOIN cities ON countries.id = cities.country_id
        GROUP BY countries.name
        ORDER BY num_cities DESC;'''
pd.read_sql(q,engine)

                        name  num_cities
0                      China         363
1                      India         341
2              United States         274
3                     Brazil         250
4                      Japan         248
..                       ...         ...
227  Virgin Islands, British           1
228     Virgin Islands, U.S.           1
229                  Vanuatu           1
230        Wallis and Futuna           1
231                    Samoa           1

[232 rows x 2 columns]

6. What query would you run to get all the cities in Mexico with a population of greater than 500,000? Your query should arrange the result by population in descending order.

In [31]:
q = '''SELECT cities.name, cities.population
        FROM countries
        JOIN cities ON countries.id = cities.country_id
        WHERE countries.name = 'Mexico' 
        AND cities.population > 500000
        ORDER BY cities.population DESC;'''
pd.read_sql(q,engine)

                     name  population
0       Ciudad de MÃ©xico     8591309
1             Guadalajara     1647720
2     Ecatepec de Morelos     1620303
3                  Puebla     1346176
4         NezahualcÃ³yotl     1224924
5                 JuÃ¡rez     1217818
6                 Tijuana     1212232
7                   LeÃ³n     1133576
8               Monterrey     1108499
9                 Zapopan     1002239
10   Naucalpan de JuÃ¡rez      857511
11               Mexicali      764902
12              CuliacÃ¡n      744859
13    Acapulco de JuÃ¡rez      721011
14    Tlalnepantla de Baz      720755
15                MÃ©rida      703324
16              Chihuahua      670208
17       San Luis PotosÃ­      669353
18              Guadalupe      668780
19                 Toluca      665617
20         Aguascalientes      643360
21             QuerÃ©taro      639839
22                Morelia      619958
23             Hermosillo      608697
24               Saltillo      577352
25               TorreÃ³n      529093
26  Centro (Villahermosa)      519873

7. What query would you run to get all languages in each country with a percentage greater than 89%? Include the country name, language, and percentage. Your query should arrange the result by percentage in descending order.

In [32]:
q = '''SELECT countries.name, languages.language, languages.percentage
        FROM countries
        JOIN languages ON countries.id = languages.country_id
        WHERE languages.percentage > 89
        ORDER BY languages.percentage DESC;'''
pd.read_sql(q,engine)

             name        language  percentage
0         Grenada  Creole English       100.0
1   Faroe Islands         Faroese       100.0
2      San Marino         Italian       100.0
3     El Salvador         Spanish       100.0
4           Haiti    Haiti Creole       100.0
..            ...             ...         ...
76          Syria          Arabic        90.0
77      Swaziland           Swazi        89.9
78          Chile         Spanish        89.7
79        Bahamas  Creole English        89.7
80         Sweden         Swedish        89.5

[81 rows x 3 columns]

8. What query would you run to get all the cities of Argentina inside the Buenos Aires district and have a population greater than 500,000? The query should return the Country Name, City Name, District, and Population.

In [34]:
q = '''SELECT countries.name, cities.name, cities.population
        FROM countries
        JOIN cities ON countries.id = cities.country_id
        WHERE countries.name = 'Argentina'
            AND cities.district = 'Buenos Aires'
            AND cities.population > 500000;'''
pd.read_sql(q,engine)

        name             name  population
0  Argentina       La Matanza     1266461
1  Argentina  Lomas de Zamora      622013
2  Argentina          Quilmes      559249
3  Argentina  Almirante Brown      538918
4  Argentina         La Plata      521936
5  Argentina    Mar del Plata      512880